app/app/controllers/characters_controller.rb

INSERT INTO "characters" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 25 Mar 2013 02:51:29 UTC +00:00], ["description", "A"], ["updated_at", Mon, 25 Mar 2013 02:51:29 UTC +00:00], ["user_id", 8]]
---
  def create
    @character = current_user.characters.new(params[:character])

    respond_to do |format|
      if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = 8 AND "characters"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
---
  def destroy
    @character = current_user.characters.find(params[:id])
    @character.destroy